{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Describes a feature update for the hidden Yes button after the No button cracks, including affected files and metadata.",
  "frontend-file-summaries.txt": "Lists concise summaries of key frontend Valentine-themed components and styles.",
  "frontend/index.css": "Defines Tailwind base variables and theming for light/dark modes with custom color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Renders ValentineExperience inside a pink gradient layout.",
  "frontend/src/components/valentine/CorrectAnswerFeedback.tsx": "Shows an animated heart and randomized romantic message after correct quiz answers.",
  "frontend/src/components/valentine/DodgingNoButton.tsx": "Implements the dodging No button with crack animation and a revealed hidden Yes button that triggers onYes.",
  "frontend/src/components/valentine/effects/ConfettiOverlay.tsx": "Generates falling confetti pieces that auto-clear after a delay.",
  "frontend/src/components/valentine/effects/FloatingHeartsOverlay.tsx": "Creates animated floating hearts that rise and disappear after a delay.",
  "frontend/src/components/valentine/ProposalScreen.tsx": "Displays the main Valentine proposal with Yes button and dodging No button wired to the success flow.",
  "frontend/src/components/valentine/quizContent.ts": "Defines quiz questions, answer options, and correct answers.",
  "frontend/src/components/valentine/QuizFlow.tsx": "Controls quiz progression, showing feedback and moving to the transition step before proposal.",
  "frontend/src/components/valentine/QuizQuestionCard.tsx": "Renders a quiz question with selectable answers and resets state between questions.",
  "frontend/src/components/valentine/SuccessScreen.tsx": "Final success message screen with animated hearts.",
  "frontend/src/components/valentine/TransitionStep.tsx": "A timed transition card that leads from quiz completion to the proposal screen.",
  "frontend/src/components/valentine/useNoButtonDodge.ts": "React hook that moves a button away from pointer or touch when too close, keeping it within container bounds.",
  "frontend/src/components/valentine/ValentineExperience.tsx": "Manages overall app flow between quiz, proposal, and success with confetti and hearts effects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login/clear actions with status tracking.",
  "frontend/src/index.css": "Global Tailwind-based styles defining Valentine-themed colors and multiple animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing the Valentine proposal app, requirements, features, issues, and architecture notes."
}